atomiechen/PressureSense/nRF5_SDK_15.2.0_9412b96/examples/ble_central/serial_uart/main.c
    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_UUID_FILTER, &m_nus_uuid);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_UUID_FILTER, false);
    APP_ERROR_CHECK(err_code);

    //设筛选广播name
    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
}


/**@brief Function for handling characters received by the Nordic UART Service (NUS).
 *
 * @details This function takes a list of characters of length data_len and prints the characters out on UART.
 *          If @ref ECHOBACK_BLE_UART_DATA is set, the data is sent back to sender.
 */
static void ble_nus_chars_received_uart_print_org(uint8_t * p_data, uint16_t data_len,bool on_hvx_flag )
{
    ret_code_t ret_val;

    //NRF_LOG_DEBUG("Receiving data.");
    //NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);
    do
    {
        ret_val = app_uart_put(0xFF);
        if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
        {
          NRF_LOG_ERROR("TX_put failed.");
           // APP_ERROR_CHECK(ret_val);
        }
    } while (ret_val == NRF_ERROR_BUSY);
  
    //扩增数列
    uint8_t Data_long[256 + 2*9];
    
    if (data_len >= 224) {
      decompress_data_224(p_data, Data_long);
      // copy IMU data
      for (int i = 224; i < data_len; i++) {
        Data_long[i - 224 + 256] = p_data[i];
      }
      data_len = data_len - 224 + 256;
    } else {
      for (int i = 0; i < data_len; i++) {
        Data_long[i] = p_data[i];
      }
    }

    if(on_hvx_flag==0)
    {
      for (uint32_t i = 0; i < data_len; i++)
      {
        do
        {
            ret_val = app_uart_put(Data_long[i]);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
              NRF_LOG_ERROR("TX_put failed for index 0x?%04x : %04x.", i, ret_val);
               // APP_ERROR_CHECK(ret_val);
            }
        } while (ret_val == NRF_ERROR_BUSY);
      }
    }
}

void put_byte(uint8_t data) {
  ret_code_t ret_val;
  do
  {
      ret_val = app_uart_put(data);
      if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
      {
        NRF_LOG_ERROR("TX_put failed.");
         // APP_ERROR_CHECK(ret_val);
      }
  } while (ret_val == NRF_ERROR_BUSY);
}

static void ble_nus_chars_received_uart_print(uint8_t * p_data, uint16_t data_len,bool on_hvx_flag )
{
    ret_code_t ret_val;

    //扩增数列
    uint8_t Data_long[256 + 9 * sizeof(int16_t)];
    
    if (data_len >= 224) {
      decompress_data_224(p_data, Data_long);
      // copy IMU data
      for (int i = 224; i < data_len; i++) {
        Data_long[i - 224 + 256] = p_data[i];
      }
      data_len = data_len - 224 + 256;
    } else {
      for (int i = 0; i < data_len; i++) {
        Data_long[i] = p_data[i];
      }
    }

    if(on_hvx_flag==0)
    {
      put_byte(0x5B);
      for (uint32_t i = 0; i < data_len; i++)
      {
        switch(Data_long[i]) {
          case 0x5B:
            put_byte(0x5C);
            put_byte(0x01);
            break;
          case 0x5C:
            put_byte(0x5C);
            put_byte(0x00);
            break;
          case 0x5D:
            put_byte(0x5C);
            put_byte(0x02);
            break;
          default:
            put_byte(Data_long[i]);
        }
      }
      put_byte(0x5D);
    }
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function receives a single character from the app_uart module and appends it to
 *          a string. The string is sent over BLE when the last character received is a
 *          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
 */
char string[20] = "Presenab99";
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint16_t index = 0;
    uint32_t ret_val;

    switch (p_event->evt_type)
    {
        /**@snippet [Handling data from UART] */
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;
            //接收到上位机的“Refresh”指令
            if (data_array[index - 1] == 'R' && (index > 1) && data_array[index - 2] == 'R')
            {
                //传给上位机共14个字节
                app_uart_put(0xEE);
                app_uart_put(0x88);
                //一般为9个字节
                for (int i=0;i<strlen(m_target_periph_name);i++)
                    app_uart_put(m_target_periph_name[i]);
                //不足的用EE补齐
                for(int i = strlen(m_target_periph_name); i < 10; i++)
                    app_uart_put(0xEE);
                app_uart_put(0xEE);
                app_uart_put(0x77);
                index = 0;
            }
            //接收到上位机的“Update”指令
            if (data_array[index - 1] == 'U' && (index > 10) && data_array[index - 2] == 'U')
            {
                int new_name = 0;
                if(data_array[0] == 'P' && data_array[6] == 'a' && data_array[7] == 'b'){
                    new_name = data_array[8] - 0x30;
                }
                if(data_array[9] <= '9' && data_array[9] >= '0'){
                    new_name = new_name*10+(data_array[9]-0x30);
                    char a = (int)(new_name / 10) + 0x30;
                    char bb = new_name % 10 + 0x30;
                    string[8] = a;
                    string[9] = bb;
                }else{
                   char a = new_name + 0x30;
                    string[8] = a;
                    string[9] = 0;
                }
                m_target_periph_name = string;
                
                //重新设置扫描筛选条件
                scan_init();

